#+TITLE: Best time to buy and sell stock
#+DATE: <2026-06-13>
#+FILETAGS: :leetcode:sliding_window:
#+PROPERTY: header-args :results output :session *shared*

** Solution

#+begin_src python
from typing import List

class Solution:
    def maxProfit(self, prices: List[int]) -> int:
        max_profit = 0
        min_price = prices[0]
        sell = 1
        while sell < len(prices):
            profit = prices[sell] - min_price
            if profit > 0:
                if profit > max_profit:
                    max_profit = profit
            else:
                min_price = prices[sell]
            sell += 1
        return max_profit

prices = [7]
print(Solution().maxProfit(prices))
# Output: 0

prices = [7,1,5,3,6,4]
print(Solution().maxProfit(prices))
# Output: 5

prices = [7,6,4,3,1]
print(Solution().maxProfit(prices))
# Output: 0
        
#+end_src

#+RESULTS:
: 0
: 5
: 0


_Me_:

How does this solution look?

_AI_:

The solution looks good. It’s clean, correct, and runs in O(n) time with O(1) space. A few minor observations:

- You handle the edge case of a single-element array correctly (returns 0).
- The logic is clear: track =min_price= and compute profit for each sell day; when profit is non-positive, update =min_price= because a lower price is found.

One small stylistic improvement: you could simplify the inner condition by using =max_profit = max(max_profit, profit)= instead of the =if= block, but your version is perfectly fine.

Alternatively, the classic one-liner loop is:

#+begin_src python
for price in prices[1:]:
    profit = price - min_price
    max_profit = max(max_profit, profit)
    min_price = min(min_price, price)
#+end_src

But yours is just as valid. Well done.

